const regex = /\s/ug;
const text = `មហាជនទូទៅ ក៏ដូចជា អ្នកប្រើប្រាស់ នៅក្នុងបណ្តាញសង្គម ហ្វេសប៊ុក មិនតិចនាក់ទេ ច្បាស់ជាស្គាល់ ជាក់ជាមិនខាន កក្កដា សុភ័ណ្ឌ នោះ។ ហើយពេលកន្លងទៅ គាត់មានរឿងដ៏ផ្ទុះកក្រើកមួយ ធ្វើឲ្យ ពុកម៉ែ បងប្អូន ប្រជាពលរដ្ឋខ្មែរ ជាច្រើន មានការភ្ញាក់ផ្អើលយ៉ាងខ្លាំង។ តែទោះជាយ៉ាងណាក្តី រូបគាត់ ក៏តែងតែ បង្ហាញនូវសកម្មភាព សប្បុរសធម៌ ញឹកញាប់ផងដែរ តាមចិត្តជ្រះថ្លា និងកើតចេញពីក្តី អាណិតស្រឡាញ់ពិតៗ ជូនអ្នកអត់ និងត្រូវការចាំបាច់ ហើយក៏បានធ្វើឲ្យ អ្នកខ្លះពេញចិត្ត និងអ្នកខ្លះទៀតមិនពេញចិត្ត។ ចំណែកមុននេះបន្តិច នាថ្ងៃទី ០៨ ខែកុម្ភៈ ឆ្នាំ ២០២២ គ្រប់គ្នា ផ្ទុះការចាប់អារម្មណ៍ និងភ្ញាក់ផ្អើលសារជាថ្មី ក្រោយឃើញ កក្កដា សុភ័ណ្ឌ

​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​

បានចុះកុងត្រា ជាមួយហាងមួយនេះ រយៈពេល១ឆ្នាំ ទទួលបានលុយរហូតដល់ទៅ 10000\$ ឯណោះ។ រំភើបចិត្តពេក កក្កដា សុភ័ណ្ឌ បានប្រាប់ថា “ថ្ងៃនេះ ខ្ញុំមានដំណឹងពិសេសមួយ មកចែករំលែកជាមួយ អ្នកទាំងអស់គ្នា! ខ្ញុំពិតជាមានកិតិ្ដយសជាខ្លាំង ដែលបានក្លាយខ្លួនជា(ទូតសុច្ឆន្ទៈ) 10000\$ កុងត្រា ចំនួនមួយឆ្នាំពេញ ថ្មីដំបូងបំផុត របស់ហាង តី អូន (លក់គ្រឿងចម្លាក់ឈើ) ហើយលើសពីនេះទៀត ខ្ញុំពិតជារីករាយ ដែលបានចាប់ដៃគូ ជាមួយបងស្រី មានគោលដៅដូចគ្នា។ ពួកយើងនឹងមានការងារពិសេសៗ ជាច្រើន ដើម្បីចែករំលែកដល់បងប្អូន”។ ឃើញបែបនេះ ហ្វេនៗជាច្រើន របស់ សុភ័ណ្ឌ បានចូល comment បែបនេះថា ៖ ខំជេរគាត់ទៀតទៅ គាត់ធ្វើឆ្គួ តឡប់ ប៉ុន្តែគាត់មិនលេងសើចជាមួយការងាររបស់គាត់ទេ, ចូលរួមអបអរផងស្រីតូច, Congratulations។ នៅមានពាក្យអបអរសាទរ និងសម្តែងក្តីរំភើបចិត្តជាច្រើនទៀត ចំពោះ កក្កដា សុភ័ណ្ឌ។ ដើម្បីជ្រាប កាន់តែច្បាស់បន្ថែមទៀត សូមមើលរូបភាពខាងក្រោមនេះ ទំាងអស់គ្នា ៖`;
// let m;
// while ((m = regex.exec(str)) !== null) {
//     // This is necessary to avoid infinite loops with zero-width matches
//     if (m.index === regex.lastIndex) {
//         regex.lastIndex++;
//     }
    
//     // The result can be accessed through the `m`-variable.
//     m.forEach((match, groupIndex) => {
//         console.log(`Found match, group ${groupIndex}: ${match}`);
//     });
// }

const dot = '🔴';

console.log(text.replaceAll(regex, dot))

// const words = text.split('\n');

// if (words) {
//     for(let word of words) {
//         // console.log(word.replace(/\u0020/gu, '*')); // space
//         // console.log(word.replace(/\u000a/gu, '*')); // \n
//         // console.log(word.replace('/\u000c/gu', '*')); // \f
//         // console.log(word.replace('/\u000d/gu', '*')); // \r
//         console.log(word.replace('/\u00a0/gu', '*'));

        
//     }
// }